# Conductor Size Get Conductor Size Ids Method

Source: https://www.revitapidocs.com/2026/5645709f-6021-fa58-ec2d-649a04776dc3.htm

---

| Conductor Size Get Conductor Size Ids Method |
| --- |

Gets all the Conductor Size ids in the given document, sorted by name.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static IList<ElementId> GetConductorSizeIds(
	Document document
)
```

```
Public Shared Function GetConductorSizeIds (
	document As Document
) As IList(Of ElementId)
```

```
public:
static IList<ElementId^>^ GetConductorSizeIds(
	Document^ document
)
```

```
static member GetConductorSizeIds :
        document : Document -> IList<ElementId>
```

#### Parameters

document Document
:   The document.

#### Return Value

IList ElementId
All the Conductor Size ids in this document. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | document is not a project document. |
| ArgumentNullException | A non\-optional argument was null |
| InvalidOperationException | The document is in failure mode: an operation has failed,  and Revit requires the user to either cancel the operation  or fix the problem (usually by deleting certain elements). |

See Also

#### Reference

ConductorSize Class Autodesk.Revit.DB.Electrical Namespace